Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/include/proc/p32mz2064dag176.h
extern volatile __GLCDCURDATA120bits_t GLCDCURDATA120bits __asm__ ("GLCDCURDATA120") __attribute__((section("sfrs"), address(0xBF8EA9E0)));
#define GLCDCURDATA121 GLCDCURDATA121
extern volatile uint32_t   GLCDCURDATA121 __attribute__((section("sfrs"), address(0xBF8EA9E4)));
typedef struct {
  uint32_t PIXEL3015:4;
  uint32_t PIXEL3014:4;
  uint32_t PIXEL3013:4;
  uint32_t PIXEL3012:4;
  uint32_t PIXEL3011:4;
  uint32_t PIXEL3010:4;
  uint32_t PIXEL309:4;
  uint32_t PIXEL308:4;
} __GLCDCURDATA121bits_t;
extern volatile __GLCDCURDATA121bits_t GLCDCURDATA121bits __asm__ ("GLCDCURDATA121") __attribute__((section("sfrs"), address(0xBF8EA9E4)));
#define GLCDCURDATA122 GLCDCURDATA122
extern volatile uint32_t   GLCDCURDATA122 __attribute__((section("sfrs"), address(0xBF8EA9E8)));
typedef struct {
  uint32_t PIXEL3023:4;
  uint32_t PIXEL3022:4;
  uint32_t PIXEL3021:4;
  uint32_t PIXEL3020:4;
  uint32_t PIXEL3019:4;
  uint32_t PIXEL3018:4;
  uint32_t PIXEL3017:4;
  uint32_t PIXEL3016:4;
} __GLCDCURDATA122bits_t;
extern volatile __GLCDCURDATA122bits_t GLCDCURDATA122bits __asm__ ("GLCDCURDATA122") __attribute__((section("sfrs"), address(0xBF8EA9E8)));
#define GLCDCURDATA123 GLCDCURDATA123
extern volatile uint32_t   GLCDCURDATA123 __attribute__((section("sfrs"), address(0xBF8EA9EC)));
typedef struct {
  uint32_t PIXEL3031:4;
  uint32_t PIXEL3030:4;
  uint32_t PIXEL3029:4;
  uint32_t PIXEL3028:4;
  uint32_t PIXEL3027:4;
  uint32_t PIXEL3026:4;
  uint32_t PIXEL3025:4;
  uint32_t PIXEL3024:4;
} __GLCDCURDATA123bits_t;
extern volatile __GLCDCURDATA123bits_t GLCDCURDATA123bits __asm__ ("GLCDCURDATA123") __attribute__((section("sfrs"), address(0xBF8EA9EC)));
#define GLCDCURDATA124 GLCDCURDATA124
extern volatile uint32_t   GLCDCURDATA124 __attribute__((section("sfrs"), address(0xBF8EA9F0)));
typedef struct {
  uint32_t PIXEL317:4;
  uint32_t PIXEL316:4;
  uint32_t PIXEL315:4;
  uint32_t PIXEL314:4;
  uint32_t PIXEL313:4;
  uint32_t PIXEL312:4;
  uint32_t PIXEL311:4;
  uint32_t PIXEL310:4;
} __GLCDCURDATA124bits_t;
extern volatile __GLCDCURDATA124bits_t GLCDCURDATA124bits __asm__ ("GLCDCURDATA124") __attribute__((section("sfrs"), address(0xBF8EA9F0)));
#define GLCDCURDATA125 GLCDCURDATA125
extern volatile uint32_t   GLCDCURDATA125 __attribute__((section("sfrs"), address(0xBF8EA9F4)));
typedef struct {
  uint32_t PIXEL3115:4;
  uint32_t PIXEL3114:4;
  uint32_t PIXEL3113:4;
  uint32_t PIXEL3112:4;
  uint32_t PIXEL3111:4;
  uint32_t PIXEL3110:4;
  uint32_t PIXEL319:4;
  uint32_t PIXEL318:4;
} __GLCDCURDATA125bits_t;
extern volatile __GLCDCURDATA125bits_t GLCDCURDATA125bits __asm__ ("GLCDCURDATA125") __attribute__((section("sfrs"), address(0xBF8EA9F4)));
#define GLCDCURDATA126 GLCDCURDATA126
extern volatile uint32_t   GLCDCURDATA126 __attribute__((section("sfrs"), address(0xBF8EA9F8)));
typedef struct {
  uint32_t PIXEL3123:4;
  uint32_t PIXEL3122:4;
  uint32_t PIXEL3121:4;
  uint32_t PIXEL3120:4;
  uint32_t PIXEL3119:4;
  uint32_t PIXEL3118:4;
  uint32_t PIXEL3117:4;
  uint32_t PIXEL3116:4;
} __GLCDCURDATA126bits_t;
extern volatile __GLCDCURDATA126bits_t GLCDCURDATA126bits __asm__ ("GLCDCURDATA126") __attribute__((section("sfrs"), address(0xBF8EA9F8)));
#define GLCDCURDATA127 GLCDCURDATA127
extern volatile uint32_t   GLCDCURDATA127 __attribute__((section("sfrs"), address(0xBF8EA9FC)));
typedef struct {
  uint32_t PIXEL3131:4;
  uint32_t PIXEL3130:4;
  uint32_t PIXEL3129:4;
  uint32_t PIXEL3128:4;
  uint32_t PIXEL3127:4;
  uint32_t PIXEL3126:4;
  uint32_t PIXEL3125:4;
  uint32_t PIXEL3124:4;
} __GLCDCURDATA127bits_t;
extern volatile __GLCDCURDATA127bits_t GLCDCURDATA127bits __asm__ ("GLCDCURDATA127") __attribute__((section("sfrs"), address(0xBF8EA9FC)));
#define GLCDCURLUT0 GLCDCURLUT0
extern volatile uint32_t   GLCDCURLUT0 __attribute__((section("sfrs"), address(0xBF8EAA00)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCURLUT0bits_t;
extern volatile __GLCDCURLUT0bits_t GLCDCURLUT0bits __asm__ ("GLCDCURLUT0") __attribute__((section("sfrs"), address(0xBF8EAA00)));
#define GLCDCURLUT1 GLCDCURLUT1
extern volatile uint32_t   GLCDCURLUT1 __attribute__((section("sfrs"), address(0xBF8EAA04)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCURLUT1bits_t;
extern volatile __GLCDCURLUT1bits_t GLCDCURLUT1bits __asm__ ("GLCDCURLUT1") __attribute__((section("sfrs"), address(0xBF8EAA04)));
#define GLCDCURLUT2 GLCDCURLUT2
extern volatile uint32_t   GLCDCURLUT2 __attribute__((section("sfrs"), address(0xBF8EAA08)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCURLUT2bits_t;
extern volatile __GLCDCURLUT2bits_t GLCDCURLUT2bits __asm__ ("GLCDCURLUT2") __attribute__((section("sfrs"), address(0xBF8EAA08)));
#define GLCDCURLUT3 GLCDCURLUT3
extern volatile uint32_t   GLCDCURLUT3 __attribute__((section("sfrs"), address(0xBF8EAA0C)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCURLUT3bits_t;
extern volatile __GLCDCURLUT3bits_t GLCDCURLUT3bits __asm__ ("GLCDCURLUT3") __attribute__((section("sfrs"), address(0xBF8EAA0C)));
#define GLCDCURLUT4 GLCDCURLUT4
extern volatile uint32_t   GLCDCURLUT4 __attribute__((section("sfrs"), address(0xBF8EAA10)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCURLUT4bits_t;
extern volatile __GLCDCURLUT4bits_t GLCDCURLUT4bits __asm__ ("GLCDCURLUT4") __attribute__((section("sfrs"), address(0xBF8EAA10)));
#define GLCDCURLUT5 GLCDCURLUT5
extern volatile uint32_t   GLCDCURLUT5 __attribute__((section("sfrs"), address(0xBF8EAA14)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCURLUT5bits_t;
extern volatile __GLCDCURLUT5bits_t GLCDCURLUT5bits __asm__ ("GLCDCURLUT5") __attribute__((section("sfrs"), address(0xBF8EAA14)));
#define GLCDCURLUT6 GLCDCURLUT6
extern volatile uint32_t   GLCDCURLUT6 __attribute__((section("sfrs"), address(0xBF8EAA18)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCURLUT6bits_t;
extern volatile __GLCDCURLUT6bits_t GLCDCURLUT6bits __asm__ ("GLCDCURLUT6") __attribute__((section("sfrs"), address(0xBF8EAA18)));
#define GLCDCURLUT7 GLCDCURLUT7
extern volatile uint32_t   GLCDCURLUT7 __attribute__((section("sfrs"), address(0xBF8EAA1C)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCURLUT7bits_t;
extern volatile __GLCDCURLUT7bits_t GLCDCURLUT7bits __asm__ ("GLCDCURLUT7") __attribute__((section("sfrs"), address(0xBF8EAA1C)));
#define GLCDCURLUT8 GLCDCURLUT8
extern volatile uint32_t   GLCDCURLUT8 __attribute__((section("sfrs"), address(0xBF8EAA20)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCURLUT8bits_t;
extern volatile __GLCDCURLUT8bits_t GLCDCURLUT8bits __asm__ ("GLCDCURLUT8") __attribute__((section("sfrs"), address(0xBF8EAA20)));
#define GLCDCURLUT9 GLCDCURLUT9
extern volatile uint32_t   GLCDCURLUT9 __attribute__((section("sfrs"), address(0xBF8EAA24)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCURLUT9bits_t;
extern volatile __GLCDCURLUT9bits_t GLCDCURLUT9bits __asm__ ("GLCDCURLUT9") __attribute__((section("sfrs"), address(0xBF8EAA24)));
#define GLCDCURLUT10 GLCDCURLUT10
extern volatile uint32_t   GLCDCURLUT10 __attribute__((section("sfrs"), address(0xBF8EAA28)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCURLUT10bits_t;
extern volatile __GLCDCURLUT10bits_t GLCDCURLUT10bits __asm__ ("GLCDCURLUT10") __attribute__((section("sfrs"), address(0xBF8EAA28)));
#define GLCDCURLUT11 GLCDCURLUT11
extern volatile uint32_t   GLCDCURLUT11 __attribute__((section("sfrs"), address(0xBF8EAA2C)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCURLUT11bits_t;
