Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/include/proc/p32mz2064dag176.h
#define _GLCDCURDATA123_PIXEL3029_POSITION       0x00000008
#define _GLCDCURDATA123_PIXEL3029_MASK           0x00000F00
#define _GLCDCURDATA123_PIXEL3029_LENGTH         0x00000004

#define _GLCDCURDATA123_PIXEL3028_POSITION       0x0000000C
#define _GLCDCURDATA123_PIXEL3028_MASK           0x0000F000
#define _GLCDCURDATA123_PIXEL3028_LENGTH         0x00000004

#define _GLCDCURDATA123_PIXEL3027_POSITION       0x00000010
#define _GLCDCURDATA123_PIXEL3027_MASK           0x000F0000
#define _GLCDCURDATA123_PIXEL3027_LENGTH         0x00000004

#define _GLCDCURDATA123_PIXEL3026_POSITION       0x00000014
#define _GLCDCURDATA123_PIXEL3026_MASK           0x00F00000
#define _GLCDCURDATA123_PIXEL3026_LENGTH         0x00000004

#define _GLCDCURDATA123_PIXEL3025_POSITION       0x00000018
#define _GLCDCURDATA123_PIXEL3025_MASK           0x0F000000
#define _GLCDCURDATA123_PIXEL3025_LENGTH         0x00000004

#define _GLCDCURDATA123_PIXEL3024_POSITION       0x0000001C
#define _GLCDCURDATA123_PIXEL3024_MASK           0xF0000000
#define _GLCDCURDATA123_PIXEL3024_LENGTH         0x00000004

#define _GLCDCURDATA124_PIXEL317_POSITION        0x00000000
#define _GLCDCURDATA124_PIXEL317_MASK            0x0000000F
#define _GLCDCURDATA124_PIXEL317_LENGTH          0x00000004

#define _GLCDCURDATA124_PIXEL316_POSITION        0x00000004
#define _GLCDCURDATA124_PIXEL316_MASK            0x000000F0
#define _GLCDCURDATA124_PIXEL316_LENGTH          0x00000004

#define _GLCDCURDATA124_PIXEL315_POSITION        0x00000008
#define _GLCDCURDATA124_PIXEL315_MASK            0x00000F00
#define _GLCDCURDATA124_PIXEL315_LENGTH          0x00000004

#define _GLCDCURDATA124_PIXEL314_POSITION        0x0000000C
#define _GLCDCURDATA124_PIXEL314_MASK            0x0000F000
#define _GLCDCURDATA124_PIXEL314_LENGTH          0x00000004

#define _GLCDCURDATA124_PIXEL313_POSITION        0x00000010
#define _GLCDCURDATA124_PIXEL313_MASK            0x000F0000
#define _GLCDCURDATA124_PIXEL313_LENGTH          0x00000004

#define _GLCDCURDATA124_PIXEL312_POSITION        0x00000014
#define _GLCDCURDATA124_PIXEL312_MASK            0x00F00000
#define _GLCDCURDATA124_PIXEL312_LENGTH          0x00000004

#define _GLCDCURDATA124_PIXEL311_POSITION        0x00000018
#define _GLCDCURDATA124_PIXEL311_MASK            0x0F000000
#define _GLCDCURDATA124_PIXEL311_LENGTH          0x00000004

#define _GLCDCURDATA124_PIXEL310_POSITION        0x0000001C
#define _GLCDCURDATA124_PIXEL310_MASK            0xF0000000
#define _GLCDCURDATA124_PIXEL310_LENGTH          0x00000004

#define _GLCDCURDATA125_PIXEL3115_POSITION       0x00000000
#define _GLCDCURDATA125_PIXEL3115_MASK           0x0000000F
#define _GLCDCURDATA125_PIXEL3115_LENGTH         0x00000004

#define _GLCDCURDATA125_PIXEL3114_POSITION       0x00000004
#define _GLCDCURDATA125_PIXEL3114_MASK           0x000000F0
#define _GLCDCURDATA125_PIXEL3114_LENGTH         0x00000004

#define _GLCDCURDATA125_PIXEL3113_POSITION       0x00000008
#define _GLCDCURDATA125_PIXEL3113_MASK           0x00000F00
#define _GLCDCURDATA125_PIXEL3113_LENGTH         0x00000004

#define _GLCDCURDATA125_PIXEL3112_POSITION       0x0000000C
#define _GLCDCURDATA125_PIXEL3112_MASK           0x0000F000
#define _GLCDCURDATA125_PIXEL3112_LENGTH         0x00000004

#define _GLCDCURDATA125_PIXEL3111_POSITION       0x00000010
#define _GLCDCURDATA125_PIXEL3111_MASK           0x000F0000
#define _GLCDCURDATA125_PIXEL3111_LENGTH         0x00000004

#define _GLCDCURDATA125_PIXEL3110_POSITION       0x00000014
#define _GLCDCURDATA125_PIXEL3110_MASK           0x00F00000
#define _GLCDCURDATA125_PIXEL3110_LENGTH         0x00000004

#define _GLCDCURDATA125_PIXEL319_POSITION        0x00000018
#define _GLCDCURDATA125_PIXEL319_MASK            0x0F000000
#define _GLCDCURDATA125_PIXEL319_LENGTH          0x00000004

#define _GLCDCURDATA125_PIXEL318_POSITION        0x0000001C
#define _GLCDCURDATA125_PIXEL318_MASK            0xF0000000
#define _GLCDCURDATA125_PIXEL318_LENGTH          0x00000004

#define _GLCDCURDATA126_PIXEL3123_POSITION       0x00000000
#define _GLCDCURDATA126_PIXEL3123_MASK           0x0000000F
#define _GLCDCURDATA126_PIXEL3123_LENGTH         0x00000004

#define _GLCDCURDATA126_PIXEL3122_POSITION       0x00000004
#define _GLCDCURDATA126_PIXEL3122_MASK           0x000000F0
#define _GLCDCURDATA126_PIXEL3122_LENGTH         0x00000004

#define _GLCDCURDATA126_PIXEL3121_POSITION       0x00000008
#define _GLCDCURDATA126_PIXEL3121_MASK           0x00000F00
#define _GLCDCURDATA126_PIXEL3121_LENGTH         0x00000004

#define _GLCDCURDATA126_PIXEL3120_POSITION       0x0000000C
#define _GLCDCURDATA126_PIXEL3120_MASK           0x0000F000
#define _GLCDCURDATA126_PIXEL3120_LENGTH         0x00000004

#define _GLCDCURDATA126_PIXEL3119_POSITION       0x00000010
#define _GLCDCURDATA126_PIXEL3119_MASK           0x000F0000
#define _GLCDCURDATA126_PIXEL3119_LENGTH         0x00000004

#define _GLCDCURDATA126_PIXEL3118_POSITION       0x00000014
#define _GLCDCURDATA126_PIXEL3118_MASK           0x00F00000
#define _GLCDCURDATA126_PIXEL3118_LENGTH         0x00000004

#define _GLCDCURDATA126_PIXEL3117_POSITION       0x00000018
#define _GLCDCURDATA126_PIXEL3117_MASK           0x0F000000
#define _GLCDCURDATA126_PIXEL3117_LENGTH         0x00000004

#define _GLCDCURDATA126_PIXEL3116_POSITION       0x0000001C
#define _GLCDCURDATA126_PIXEL3116_MASK           0xF0000000
#define _GLCDCURDATA126_PIXEL3116_LENGTH         0x00000004

#define _GLCDCURDATA127_PIXEL3131_POSITION       0x00000000
#define _GLCDCURDATA127_PIXEL3131_MASK           0x0000000F
#define _GLCDCURDATA127_PIXEL3131_LENGTH         0x00000004

#define _GLCDCURDATA127_PIXEL3130_POSITION       0x00000004
#define _GLCDCURDATA127_PIXEL3130_MASK           0x000000F0
#define _GLCDCURDATA127_PIXEL3130_LENGTH         0x00000004

#define _GLCDCURDATA127_PIXEL3129_POSITION       0x00000008
#define _GLCDCURDATA127_PIXEL3129_MASK           0x00000F00
#define _GLCDCURDATA127_PIXEL3129_LENGTH         0x00000004

#define _GLCDCURDATA127_PIXEL3128_POSITION       0x0000000C
#define _GLCDCURDATA127_PIXEL3128_MASK           0x0000F000
#define _GLCDCURDATA127_PIXEL3128_LENGTH         0x00000004

#define _GLCDCURDATA127_PIXEL3127_POSITION       0x00000010
#define _GLCDCURDATA127_PIXEL3127_MASK           0x000F0000
#define _GLCDCURDATA127_PIXEL3127_LENGTH         0x00000004

#define _GLCDCURDATA127_PIXEL3126_POSITION       0x00000014
#define _GLCDCURDATA127_PIXEL3126_MASK           0x00F00000
#define _GLCDCURDATA127_PIXEL3126_LENGTH         0x00000004

#define _GLCDCURDATA127_PIXEL3125_POSITION       0x00000018
#define _GLCDCURDATA127_PIXEL3125_MASK           0x0F000000
#define _GLCDCURDATA127_PIXEL3125_LENGTH         0x00000004

